Revit 2027 API
ColorFillScheme.RemoveEntry Method
 Removes an entry whose parameter value is the same as the input from the scheme
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveEntry(
	ColorFillSchemeEntry entry
)
Public Sub RemoveEntry (
	entry As ColorFillSchemeEntry
)
public:
void RemoveEntry(
	ColorFillSchemeEntry^ entry
)
member RemoveEntry :
        entry : ColorFillSchemeEntry -> unit
Parameters
entry ColorFillSchemeEntry
 The entry to remove.
Exceptions
Exception | Condition
ArgumentException |  The entry cannot be removed from the scheme.
ArgumentNullException |  A non-optional argument was null
Remarks
 The entry can not be removed if it is in use.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace